Agat/src/Catalogs/РаспоряженияТД/РаспоряженияТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РаспоряженияТД</name>
  <basedOn>Catalog.Договора</basedOn>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнители</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйИсполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитыДокументаПодтверждающегоИсполнение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСЗаказчиком</name>
    <type>
      <types>CatalogRef.Договора</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСПодрядчиком</name>
    <type>
      <types>CatalogRef.ДоговораСубподряда</types>
    </type>
  </attributes>
  <attributes>
    <name>Контроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Н</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутренниеДокументы</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящиеДокументы</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящиеДокументы</name>
    <type>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставИсполнителей</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Приложения</name>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РасширениеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Agat/src/Catalogs/РаспоряженияТД/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Перем ПутьХранилищаКлиент; // Путь к архиву из константы

/////////////////////////////////////////////////////////////////////////////////////////// 

///////////////////////////////////////////////////////////////////////////////////////////
// Устанавливаем значение фильтра по умолчанию для: 
// период с - по : начало текущего месяца - конец текущего месяца
// ОтборНеИсполненные : вкл. 
///////////////////////////////////////////////////////////////////////////////////////////	
///////////////////////////////////////////////////////////////////////////////////////////
// Настройка выпадающего списка "Выбор Исполнителя"
// Поле.РежимВыбораИзСписка = Истина;  
// Поле.КнопкаСоздания = Ложь;         //Убираем системные кнопки "+" 
// Поле.КнопкаВыбора   = Ложь;         //Убираем системные кнопки "Показать все" 
// Поле.КнопкаСпискаВыбора = Ложь;     //Убираем системные кнопки "Стрелка выпадающего списка"
///////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////											
// ОтборЗнакДаты = "=";	// Установка значения по умолчанию для параметра фильтра отбора по ДатаПоступления - значение Кнопки ( = ; < ; > )
////////////////////////////////////////////////////////////////////////////////	
// 
///////////////////////////////////////////////////////////////////////////////////////////

// =============================================================================
// СЕРВЕРНЫЕ МЕТОДЫ (ИНИЦИАЛИЗАЦИЯ)
// =============================================================================

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Получаем путь на сервере один раз
	ПутьХранилищаКлиент = Константы.ПутьХранилищаФайлов.Получить(); 
	
	// 1. Устанавливаем флаг "Только неисполненные" в значение Истина
	ОтборНеИсполненные = Истина;
	
	// 2. Установка дат текущего месяца по умолчанию (если это требуется)
	ДатаНачала    = '00010101' ;  //НачалоМесяца(ТекущаяДата())
	ДатаОкончания = КонецМесяца(ТекущаяДата());
	
    // 3. Настройка выпадающего списка "ОтборТекущийМножественный"
    Поле = Элементы.ОтборТекущийМножественный;
    Поле.РежимВыбораИзСписка = Истина;
    Поле.КнопкаСоздания = Ложь;          // Убираем кнопку "+"
    Поле.КнопкаВыбора = Ложь;            // Убираем кнопку "Показать все"
//    Поле.КнопкаСпискаВыбора = Истина;    // Оставляем стрелочку
    Поле.КнопкаОчистки = Истина;         // Оставляем крестик для очистки
    Поле.РастягиватьПоГоризонтали = Ложь;
    
    // 4. Заполняем список сотрудников
    ЗаполнитьСписокСотрудников();
    
    // 5. Настройка кнопки переключателя
    РежимФильтра = "Ответственный";  // Устанавливаем значение реквизита  Исполнители/Ответственный
    Элементы.КнопкаПереключатель.Картинка = БиблиотекаКартинок.картинка_6;
//    Элементы.КнопкаПереключатель.Подсказка = "Текущий режим: Исполнители";
//    Элементы.ОтборТекущийМножественный.Подсказка = "Выберите исполнителей";
    
    // 6. Применяем фильтры
    ОбновитьФильтрыНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПутьХранилищаНаСервере()
	Возврат Константы.ПутьХранилищаФайлов.Получить();
КонецФункции

// =============================================================================
// КЛИЕНТСКИЕ МЕТОДЫ (ЛОГИКА И КОМАНДЫ)
// =============================================================================

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Подтягиваем путь на клиент, если он не заполнился
	Если ПустаяСтрока(ПутьХранилищаКлиент) Тогда
		ПутьХранилищаКлиент = ПолучитьПутьХранилищаНаСервере();
	КонецЕсли;
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////////////// 
// EXCEL // Заполнение реквизитов справочника из EXCEL работает с ОбщейФормой 
//       // ДиалогНастройкиКолонок и Общим модулем ЗагрузкаДанныхСервер
///////////////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ЗагрузитьИзExcel(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Excel (*.xlsx)|*.xlsx";
	Диалог.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы = Неопределено Тогда Возврат; КонецЕсли;
	
	// Извлекаем путь (строку) из массива
	ЭтаФорма.ПутьКФайлу = ?(ТипЗнч(ВыбранныеФайлы) = Тип("Массив"), ВыбранныеФайлы[0], ВыбранныеФайлы);
	
	// ОПРЕДЕЛЯЕМ КОНКРЕТНЫЕ РЕКВИЗИТЫ ДЛЯ ЗАПОЛНЕНИЯ в коде
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("НомерДокумента",          "Номер распоряжения");
	СписокПолей.Добавить("ДатаДокумента",          "Дата распоряжения");
	
	СписокПолей.Добавить("Изделие",          "Изделие");	
	
	СписокПолей.Добавить("Исполнители",         "Исполнители");
	СписокПолей.Добавить("ОтветственныйИсполнитель",          "Ответственный исполнитель");
	
	СписокПолей.Добавить("СрокИсполнения",    "Срок исполнения");
	СписокПолей.Добавить("ДатаИсполнения", "Дата исполнения");
	
	СписокПолей.Добавить("Примечание",    "Примечание"); 
	СписокПолей.Добавить("РеквизитыДокументаПодтверждающегоИсполнение",    "Реквизиты документа подтверждающего исполннеие");
		
	СписокПолей.Добавить("ДоговорСЗаказчиком",    "Договор с Заказчиком");		
	СписокПолей.Добавить("ДоговорСПодрядчиком",    "Договор с Подрядчиком");
	
	СписокПолей.Добавить("Контроль",    "Контроль");
    СписокПолей.Добавить("Н",    "Н");
	
	//////////////////////////////////////////////////////////////////////////////
	
	ПараметрыДиалога = Новый Структура;
	ПараметрыДиалога.Вставить("СписокПолей",    СписокПолей);
	ПараметрыДиалога.Вставить("СписокЛистов",   ЗагрузкаДанныхСервер.ПолучитьСписокЛистов(ЭтаФорма.ПутьКФайлу));
	ПараметрыДиалога.Вставить("ИмяСправочника", "РаспоряженияТД");

	// Открытие ОТДЕЛЬНОГО БЛОКИРУЮЩЕГО ОКНА
	ОповещениеЗакрытия = Новый ОписаниеОповещения("ПослеНастройки", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ДиалогНастройкиКолонок", 
	             ПараметрыДиалога, 
	             ЭтотОбъект, 
	             Истина, // Уникальность
	             , 
	             , 
	             ОповещениеЗакрытия, 
	             РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ПослеНастройки(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда Возврат; КонецЕсли;

	Попытка
		Лог = ЗагрузкаДанныхСервер.ЗагрузитьДанные(
			Неопределено, 
			ЭтаФорма.ПутьКФайлу, 
			Результат.НастройкиКолонок, 
			Результат.СтартоваяСтрока, 
			Результат.КонечнаяСтрока, 
			Результат.ИмяСправочника, 
			Результат.ИмяЛиста
		);
		Элементы.Список.Обновить();
		ПоказатьОповещениеПользователя("Загрузка завершена", , "Успешно: " + Лог.Успешно);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры
///////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////


///////////////////////////////////////////////////////////////////////////////////////////  
// ПРИЛОЖЕНИЕ // Сохранение / Просмотр сохраненых / Удаление в архив приложенных файлов  
///////////////////////////////////////////////////////////////////////////////////////////

// Событие при смене строки: обновляет кнопку на панели (актуально для 2026 г.)
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	КнопкаПанели = Элементы.Найти("КнопкаДействие"); 
	
	Если КнопкаПанели <> Неопределено Тогда
		
		// Проверяем наличие файла по РасширениеФайла
		Если ТекущиеДанные <> Неопределено И НЕ ПустаяСтрока(ТекущиеДанные.РасширениеФайла) Тогда
			// Файл есть — кнопка активна, иконка ПРОСМОТР
			КнопкаПанели.Картинка  = БиблиотекаКартинок.картинка_2; 
			КнопкаПанели.Заголовок = "Просмотреть файл";
			КнопкаПанели.Доступность = Истина;
		Иначе
			// Файла нет — кнопка неактивна
			КнопкаПанели.Картинка  = БиблиотекаКартинок.картинка_1; 
			КнопкаПанели.Заголовок = "Файл отсутствует";
			КнопкаПанели.Доступность = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Команда открытия файла (использует скрытый UUID)
&НаКлиенте
Асинх Процедура КомандаДействие(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено ИЛИ ПустаяСтрока(ТекущиеДанные.РасширениеФайла) Тогда
		Возврат;
	КонецЕсли;

	// Сборка пути: Путь + UUID + Расширение
	// СтрШаблон исключает ошибку "Преобразование к типу Число"
	ПутьВАрхиве = СтрШаблон("%1\%2%3", 
		ПутьХранилищаКлиент, 
		Строка(ТекущиеДанные.УникальныйИдентификатор), 
		ТекущиеДанные.РасширениеФайла);
	
	ФайлИсточник = Новый Файл(ПутьВАрхиве);
	Если НЕ Ждать ФайлИсточник.СуществуетАсинх() Тогда
		ПоказатьПредупреждение(, "Файл не найден в хранилище!");
		Возврат;
	КонецЕсли;

	// Формируем красивое имя: Наименование_Номер_Дата (в формате 24-01-2026)
	СтрДата = Формат(ТекущиеДанные.ДатаДокумента, "ДФ=dd-MM-yyyy");
	
	КрасивоеИмя = СтрШаблон("%1_№ %2_от %3%4", 
		ТекущиеДанные.Наименование, 
		ТекущиеДанные.НомерДокумента, 
		СтрДата, 
		ТекущиеДанные.РасширениеФайла);

	// Очистка от запрещенных символов Windows (\ / : * ? " < > |)
	СимволыЗамены = "\/:*?""<>|";
	Для Поз = 1 По СтрДлина(СимволыЗамены) Цикл
		КрасивоеИмя = СтрЗаменить(КрасивоеИмя, Сред(СимволыЗамены, Поз, 1), "-");
	КонецЦикла;

	// Подготавливаем временную копию и открываем асинхронно
	ПутьОткрытия = КаталогВременныхФайлов() + КрасивоеИмя;
	
	Попытка
		КопироватьФайл(ПутьВАрхиве, ПутьОткрытия);
		Ждать ЗапуститьПриложениеАсинх(ПутьОткрытия); 
	Исключение
		ПоказатьПредупреждение(, "Ошибка открытия. Убедитесь, что файл не занят другим процессом.");
	КонецПопытки;

КонецПроцедуры
///////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////
 
 
///////////////////////////////////////////////////////////////////////////////////////////
// ФИЛЬТР //
/////////////////////////////////////////////////////////////////////////////////////////// 

&НаСервере
Функция ПолучитьТекстУсловийОтбора()
    
    Условия = Новый Массив;
    
    Если ЗначениеЗаполнено(ОтборДатаДокумента) Тогда
        Знак = Элементы.КнопкаЗнакДаты.Заголовок;
        Если Знак = "=" Тогда
            Условия.Добавить("НАЧАЛОПЕРИОДА(ДатаДокумента, ДЕНЬ) = &ПарДатаДокумента");
        ИначеЕсли Знак = ">" Тогда
            Условия.Добавить("ДатаДокумента > &ПарДатаДокумента");
        Иначе
            Условия.Добавить("ДатаДокумента < &ПарДатаДокумента");
        КонецЕсли;
    КонецЕсли;
    
    Если ЗначениеЗаполнено(ОтборНомерДокумента) Тогда
        Условия.Добавить("НомерДокумента ПОДОБНО &ПарНомерДокумента");
    КонецЕсли;
    
    Если ОтборКонтроль = 1 Тогда
        Условия.Добавить("Контроль = ИСТИНА");
    ИначеЕсли ОтборКонтроль = 2 Тогда
        Условия.Добавить("Контроль = ЛОЖЬ");
    КонецЕсли;
    
    Если ОтборН = 1 Тогда
        Условия.Добавить("Н = ИСТИНА");
    ИначеЕсли ОтборН = 2 Тогда
        Условия.Добавить("Н = ЛОЖЬ");
    КонецЕсли;
    
    Если ОтборНеИсполненные Тогда
        Условия.Добавить("ДатаИсполнения = &ПустаяДата");
    КонецЕсли;
    
    
    Если ЗначениеЗаполнено(ДатаНачала) И ДатаНачала <> '00010101' Тогда
        Условия.Добавить("СрокИсполнения >= &ДатаНачала");
    КонецЕсли;
    
    Если ЗначениеЗаполнено(ДатаОкончания) И ДатаОкончания <> '00010101' Тогда
        Условия.Добавить("СрокИсполнения <= &ДатаОкончания");
    КонецЕсли;
    
    Если Условия.Количество() = 0 Тогда
        Возврат "ИСТИНА";
    Иначе
        Возврат СтрСоединить(Условия, " И ");
    КонецЕсли;
    
КонецФункции

// СПИСОК ИСПОНИТЕЛЕЙ // Формирование запроса для получения списка Испонителей для отображения в выпадающем меню выбора (Справочника-Сотрудники реквизит Наименование(ФИО)) 
///////////////////////////////////////////////////////////////////////////////////////////	
///////////////////////////////////////////////////////////////////////////////////////////
//
&НаСервере
Процедура ЗаполнитьСписокСотрудников()
    
    // Очищаем список выбора
    Элементы.ОтборТекущийМножественный.СписокВыбора.Очистить();
    
    // Получаем отфильтрованные записи
    Запрос = Новый Запрос;
    ТекстУсловий = ПолучитьТекстУсловийОтбора();
    
    Если РежимФильтра = "Исполнители" Тогда
        Запрос.Текст = 
            "ВЫБРАТЬ
            |    РаспоряженияТД.Исполнители
            |ИЗ
            |    Справочник.РаспоряженияТД КАК РаспоряженияТД
            |ГДЕ
            |    " + ТекстУсловий;
    Иначе
        Запрос.Текст = 
            "ВЫБРАТЬ РАЗЛИЧНЫЕ
            |    РаспоряженияТД.ОтветственныйИсполнитель КАК Сотрудник
            |ИЗ
            |    Справочник.РаспоряженияТД КАК РаспоряженияТД
            |ГДЕ
            |    " + ТекстУсловий + "
            |    И РаспоряженияТД.ОтветственныйИсполнитель <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)";
    КонецЕсли;
    
    // Устанавливаем параметры
    УстановитьПараметрыЗапроса(Запрос);
    
    Попытка
        Результат = Запрос.Выполнить();
        Выборка = Результат.Выбрать();
        
        УникальныеСотрудники = Новый Соответствие;
        
        Если РежимФильтра = "Исполнители" Тогда
            // Собираем уникальные ФИО из строк
            Пока Выборка.Следующий() Цикл
                СтрокаИсполнители = Выборка.Исполнители;
                Если НЕ ПустаяСтрока(СтрокаИсполнители) Тогда
                    СтрокаИсполнители = СтрЗаменить(СтрокаИсполнители, ";", ",");
                    МассивФИО = СтрРазделить(СтрокаИсполнители, ",", Ложь);
                    Для Каждого ФИО Из МассивФИО Цикл
                        ФИО = СокрЛП(ФИО);
                        Если НЕ ПустаяСтрока(ФИО) Тогда
                            УникальныеСотрудники.Вставить(ФИО, ФИО);
                        КонецЕсли;
                    КонецЦикла;
                КонецЕсли;
            КонецЦикла;
            
            // Получаем ссылки сотрудников
            Если УникальныеСотрудники.Количество() > 0 Тогда
                ЗапросСотр = Новый Запрос("ВЫБРАТЬ Ссылка, Наименование ИЗ Справочник.Сотрудники ГДЕ ПометкаУдаления = ЛОЖЬ");
                ВыборкаСотр = ЗапросСотр.Выполнить().Выбрать();
                Пока ВыборкаСотр.Следующий() Цикл
                    Если УникальныеСотрудники.Получить(ВыборкаСотр.Наименование) <> Неопределено Тогда
                        Элементы.ОтборТекущийМножественный.СписокВыбора.Добавить(ВыборкаСотр.Ссылка, ВыборкаСотр.Наименование);
                    КонецЕсли;
                КонецЦикла;
            КонецЕсли;
            
        Иначе // Ответственный
            Пока Выборка.Следующий() Цикл
                Если ЗначениеЗаполнено(Выборка.Сотрудник) Тогда
                    УникальныеСотрудники.Вставить(Выборка.Сотрудник, Выборка.Сотрудник);
                КонецЕсли;
            КонецЦикла;
            
            Если УникальныеСотрудники.Количество() > 0 Тогда
                МассивСсылок = Новый Массив;
                Для Каждого КлючЗначение Из УникальныеСотрудники Цикл
                    МассивСсылок.Добавить(КлючЗначение.Ключ);
                КонецЦикла;
                
                ЗапросСотр = Новый Запрос;
                ЗапросСотр.Текст = "ВЫБРАТЬ Ссылка, Наименование ИЗ Справочник.Сотрудники ГДЕ Ссылка В (&Масс)";
                ЗапросСотр.УстановитьПараметр("Масс", МассивСсылок);
                ВыборкаСотр = ЗапросСотр.Выполнить().Выбрать();
                Пока ВыборкаСотр.Следующий() Цикл
                    Элементы.ОтборТекущийМножественный.СписокВыбора.Добавить(ВыборкаСотр.Ссылка, ВыборкаСотр.Наименование);
                КонецЦикла;
            КонецЕсли;
        КонецЕсли;
        
        // Устанавливаем тип значения
        Элементы.ОтборТекущийМножественный.СписокВыбора.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
        Элементы.ОтборТекущийМножественный.Доступность = (Элементы.ОтборТекущийМножественный.СписокВыбора.Количество() > 0);
        
//        Сообщить("Список сотрудников обновлен, количество: " + Элементы.ОтборТекущийМножественный.СписокВыбора.Количество());
        
    Исключение
//        Сообщить("Ошибка при формировании списка сотрудников: " + ОписаниеОшибки());
//        Сообщить("Текст запроса: " + Запрос.Текст);
    КонецПопытки;
    
КонецПроцедуры

&НаСервере
Функция ПолучитьУсловияОтбора()
    
    Условия = Новый Массив;
    
    // 1. Дата документа
    Если ЗначениеЗаполнено(ОтборДатаДокумента) Тогда
        Знак = Элементы.КнопкаЗнакДаты.Заголовок;
        Если Знак = "=" Тогда
            Условия.Добавить("НАЧАЛОПЕРИОДА(ДатаДокумента, ДЕНЬ) = &ПарДатаДокумента");
        ИначеЕсли Знак = ">" Тогда
            Условия.Добавить("ДатаДокумента > &ПарДатаДокумента");
        ИначеЕсли Знак = "<" Тогда
            Условия.Добавить("ДатаДокумента < &ПарДатаДокумента");
        КонецЕсли;
    КонецЕсли;
    
    // 2. Номер документа
    Если ЗначениеЗаполнено(ОтборНомерДокумента) Тогда
        Условия.Добавить("НомерДокумента ПОДОБНО &ПарНомерДокумента");
    КонецЕсли;
    
    // 3. Контроль
    Если ОтборКонтроль = 1 Тогда
        Условия.Добавить("Контроль = ИСТИНА");
    ИначеЕсли ОтборКонтроль = 2 Тогда
        Условия.Добавить("Контроль = ЛОЖЬ");
    КонецЕсли;
    
    // 4. Н
    Если ОтборН = 1 Тогда
        Условия.Добавить("Н = ИСТИНА");
    ИначеЕсли ОтборН = 2 Тогда
        Условия.Добавить("Н = ЛОЖЬ");
    КонецЕсли;
    
    // 5. Неисполненные - ИСПРАВЛЕНО: используем параметр
    Если ОтборНеИсполненные Тогда
        Условия.Добавить("ДатаИсполнения = &ПустаяДата");
    КонецЕсли;
    
    
    // 8. Период
    Если ЗначениеЗаполнено(ДатаНачала) И ДатаНачала <> '00010101' Тогда
        Условия.Добавить("СрокИсполнения >= &ДатаНачала");
    КонецЕсли;
    
    Если ЗначениеЗаполнено(ДатаОкончания) И ДатаОкончания <> '00010101' Тогда
        Условия.Добавить("СрокИсполнения <= &ДатаОкончания");
    КонецЕсли;
    
    // Формируем результат
    Если Условия.Количество() = 0 Тогда
        Возврат "ИСТИНА";
    Иначе
        Возврат СтрСоединить(Условия, " И ");
    КонецЕсли;
    
КонецФункции

&НаСервере
Процедура УстановитьПараметрыЗапроса(Запрос)
	
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	 
    Если ЗначениеЗаполнено(ОтборДатаДокумента) Тогда
        Знак = Элементы.КнопкаЗнакДаты.Заголовок;
        Если Знак = "=" Тогда
            Запрос.УстановитьПараметр("ПарДатаДокумента", НачалоДня(ОтборДатаДокумента));
        ИначеЕсли Знак = ">" Тогда
            Запрос.УстановитьПараметр("ПарДатаДокумента", КонецДня(ОтборДатаДокумента));
        ИначеЕсли Знак = "<" Тогда
            Запрос.УстановитьПараметр("ПарДатаДокумента", НачалоДня(ОтборДатаДокумента));
        КонецЕсли;
    КонецЕсли;
// Номер документа   
    Если ЗначениеЗаполнено(ОтборНомерДокумента) Тогда
        Запрос.УстановитьПараметр("ПарНомерДокумента", "%" + СокрЛП(ОтборНомерДокумента) + "%");
    КонецЕсли;
// Период    
    Если ЗначениеЗаполнено(ДатаНачала) Тогда
        Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
    КонецЕсли;
    
    Если ЗначениеЗаполнено(ДатаОкончания) Тогда
        Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
    КонецЕсли;
	
///////////////////////////////////////////////////////////////////////////////////////////	
 // Множественный выбор (Исполнители или Ответственные)
    Если ТипЗнч(ОтборТекущийМножественный) = Тип("СписокЗначений") И ОтборТекущийМножественный.Количество() > 0 Тогда
        Если РежимФильтра = "Исполнители" Тогда
            // Для исполнителей - параметры для каждого выбранного сотрудника
            Индекс = 0;
            Для Каждого ЭлементСписка Из ОтборТекущийМножественный Цикл
                Если ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда
                    Индекс = Индекс + 1;
                    ИмяПараметра = "ПарИспМн_" + Формат(Индекс, "ЧГ=0");
                    ТекИмяСотрудника = СокрЛП(ЭлементСписка.Значение.Наименование);
                    Запрос.УстановитьПараметр(ИмяПараметра, "%" + ТекИмяСотрудника + "%");
                КонецЕсли;
            КонецЦикла;
        Иначе
            // Для ответственных - массив ссылок
            МассивСсылок = Новый Массив;
            Для Каждого ЭлементСписка Из ОтборТекущийМножественный Цикл
                Если ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда
                    МассивСсылок.Добавить(ЭлементСписка.Значение);
                КонецЕсли;
            КонецЦикла;
            Если МассивСсылок.Количество() > 0 Тогда
                Запрос.УстановитьПараметр("МассивОтветственных", МассивСсылок);
            КонецЕсли;
        КонецЕсли;
    КонецЕсли;
  ///////////////////////////////////////////////////////////////////////////////////////////
  
КонецПроцедуры	
///////////////////////////////////////////////////////////////////////////////////////////

// ФИЛЬТР + СЧЕТЧИК // (К / Н/ неисполненный / исполнитель / ОтветственныйИсполнитель / счетчик /ВходящийНомер /  ) 
/////////////////////////////////////////////////////////////////////////////////////////// 
///////////////////////////////////////////////////////////////////////////////////////////
&НаСервере
Процедура ОбновитьФильтрыНаСервере(ОбновлятьСписокСотрудников = Истина, ОбновлятьСчетчик = Истина)
    
    // Очистка настроек списка
    НастройкиСписка = Список.КомпоновщикНастроек.Настройки;
    ОтборСписка = НастройкиСписка.Отбор;
    ОтборСписка.Элементы.Очистить();
    
    // ============ ФОРМИРУЕМ УСЛОВИЯ ДЛЯ СЧЕТЧИКА ============
    УсловияСчетчика = Новый Массив;
    УсловияСчетчика.Добавить("ИСТИНА");
    
    // Создаем запрос для счетчика
    ЗапросСчетчик = Новый Запрос;
    
    // 1. Фильтр по дате документа
    Если ЗначениеЗаполнено(ОтборДатаДокумента) Тогда
        Знак = Элементы.КнопкаЗнакДаты.Заголовок;
        Если Знак = "=" Тогда
            УсловияСчетчика.Добавить("НАЧАЛОПЕРИОДА(ДатаДокумента, ДЕНЬ) = &ПарДатаДокумента");
            ЗапросСчетчик.УстановитьПараметр("ПарДатаДокумента", НачалоДня(ОтборДатаДокумента));
            ДобавитьЭлементОтбора(ОтборСписка, "ДатаДокумента", ОтборДатаДокумента, ВидСравненияКомпоновкиДанных.Равно);
        ИначеЕсли Знак = ">" Тогда
            УсловияСчетчика.Добавить("ДатаДокумента > &ПарДатаДокумента");
            ЗапросСчетчик.УстановитьПараметр("ПарДатаДокумента", КонецДня(ОтборДатаДокумента));
            ДобавитьЭлементОтбора(ОтборСписка, "ДатаДокумента", ОтборДатаДокумента, ВидСравненияКомпоновкиДанных.Больше);
        ИначеЕсли Знак = "<" Тогда
            УсловияСчетчика.Добавить("ДатаДокумента < &ПарДатаДокумента");
            ЗапросСчетчик.УстановитьПараметр("ПарДатаДокумента", НачалоДня(ОтборДатаДокумента));
            ДобавитьЭлементОтбора(ОтборСписка, "ДатаДокумента", ОтборДатаДокумента, ВидСравненияКомпоновкиДанных.Меньше);
        КонецЕсли;
    КонецЕсли;
    
    // 2. Фильтр по номеру документа
    Если ЗначениеЗаполнено(ОтборНомерДокумента) Тогда
        УсловияСчетчика.Добавить("НомерДокумента ПОДОБНО &ПарНомерДокумента");
        ЗапросСчетчик.УстановитьПараметр("ПарНомерДокумента", "%" + СокрЛП(ОтборНомерДокумента) + "%");
        ДобавитьЭлементОтбора(ОтборСписка, "НомерДокумента", ОтборНомерДокумента, ВидСравненияКомпоновкиДанных.Содержит);
    КонецЕсли;
    
    // 3. Фильтр по множественному выбору
    Если ТипЗнч(ОтборТекущийМножественный) = Тип("СписокЗначений") И ОтборТекущийМножественный.Количество() > 0 Тогда
        Если РежимФильтра = "Исполнители" Тогда
            // Для визуального списка
            ГруппаИЛИ = ОтборСписка.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
            ГруппаИЛИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
            ГруппаИЛИ.Использование = Истина;
            ГруппаИЛИ.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
            
            // Для запроса счетчика
            МассивУсловий = Новый Массив;
            Индекс = 0;
            
            Для Каждого ЭлементСписка Из ОтборТекущийМножественный Цикл
                Если ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда
                    Индекс = Индекс + 1;
                    ТекИмя = СокрЛП(ЭлементСписка.Значение.Наименование);
                    ИмяПарам = "ПарИсп_" + Индекс;
                    
                    // Визуальный список
                    НовыйОтбор = ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
                    НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Исполнители");
                    НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
                    НовыйОтбор.ПравоеЗначение = ТекИмя;
                    НовыйОтбор.Использование = Истина;
                    
                    // Запрос счетчика
                    МассивУсловий.Добавить("Исполнители ПОДОБНО &" + ИмяПарам);
                    ЗапросСчетчик.УстановитьПараметр(ИмяПарам, "%" + ТекИмя + "%");
                КонецЕсли;
            КонецЦикла;
            
            Если МассивУсловий.Количество() > 0 Тогда
                УсловияСчетчика.Добавить("(" + СтрСоединить(МассивУсловий, " ИЛИ ") + ")");
            КонецЕсли;
            
        Иначе // РежимФильтра = "Ответственный"
            МассивСсылок = Новый Массив;
            Для Каждого ЭлементСписка Из ОтборТекущийМножественный Цикл
                Если ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда
                    МассивСсылок.Добавить(ЭлементСписка.Значение);
                КонецЕсли;
            КонецЦикла;
            
            Если МассивСсылок.Количество() > 0 Тогда
                ДобавитьЭлементОтбора(ОтборСписка, "ОтветственныйИсполнитель", МассивСсылок, ВидСравненияКомпоновкиДанных.ВСписке);
                УсловияСчетчика.Добавить("ОтветственныйИсполнитель В (&МассивОтветственных)");
                ЗапросСчетчик.УстановитьПараметр("МассивОтветственных", МассивСсылок);
            КонецЕсли;
        КонецЕсли;
    КонецЕсли;
    
    // 4. Контроль
    Если ОтборКонтроль = 1 Тогда
        УсловияСчетчика.Добавить("Контроль = ИСТИНА");
        ДобавитьЭлементОтбора(ОтборСписка, "Контроль", Истина);
    ИначеЕсли ОтборКонтроль = 2 Тогда
        УсловияСчетчика.Добавить("Контроль = ЛОЖЬ");
        ДобавитьЭлементОтбора(ОтборСписка, "Контроль", Ложь);
    КонецЕсли;
    
    // 5. Н
    Если ОтборН = 1 Тогда
        УсловияСчетчика.Добавить("Н = ИСТИНА");
        ДобавитьЭлементОтбора(ОтборСписка, "Н", Истина);
    ИначеЕсли ОтборН = 2 Тогда
        УсловияСчетчика.Добавить("Н = ЛОЖЬ");
        ДобавитьЭлементОтбора(ОтборСписка, "Н", Ложь);
    КонецЕсли;
    
    // 6. Неисполненные
    Если ОтборНеИсполненные Тогда
        УсловияСчетчика.Добавить("ДатаИсполнения = &ПустаяДата");
        ЗапросСчетчик.УстановитьПараметр("ПустаяДата", '00010101');
        ДобавитьЭлементОтбора(ОтборСписка, "ДатаИсполнения", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
    КонецЕсли;
    
    
    // 9. Период
    Если ЗначениеЗаполнено(ДатаНачала) И ДатаНачала <> '00010101' Тогда
        УсловияСчетчика.Добавить("СрокИсполнения >= &ДатаНачала");
        ЗапросСчетчик.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
        ДобавитьЭлементОтбора(ОтборСписка, "СрокИсполнения", НачалоДня(ДатаНачала), ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
    КонецЕсли;
    
    Если ЗначениеЗаполнено(ДатаОкончания) И ДатаОкончания <> '00010101' Тогда
        УсловияСчетчика.Добавить("СрокИсполнения <= &ДатаОкончания");
        ЗапросСчетчик.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
        ДобавитьЭлементОтбора(ОтборСписка, "СрокИсполнения", КонецДня(ДатаОкончания), ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
    КонецЕсли;
    
    // ============ ВЫПОЛНЯЕМ ЗАПРОС СЧЕТЧИКА ============
    Если ОбновлятьСчетчик Тогда
        ЗапросСчетчик.Текст = "ВЫБРАТЬ КОЛИЧЕСТВО(Ссылка) КАК КолВо ИЗ Справочник.РаспоряженияТД ГДЕ " + СтрСоединить(УсловияСчетчика, " И ");
        
        Попытка
            Выборка = ЗапросСчетчик.Выполнить().Выбрать();
            Если Выборка.Следующий() Тогда
                ТекстКоличествоНеисполненных = "" + Формат(Выборка.КолВо, "ЧГ=0") + "";
            Иначе
                ТекстКоличествоНеисполненных = "(0)";
            КонецЕсли;
        Исключение
            ТекстКоличествоНеисполненных = "(ош)";
 //           Сообщить("Ошибка: " + ОписаниеОшибки());
        КонецПопытки;
    КонецЕсли;
    
    // Обновляем список сотрудников ТОЛЬКО когда нужно
    Если ОбновлятьСписокСотрудников Тогда
        ЗаполнитьСписокСотрудников();
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Функция ДобавитьЭлементОтбора(ГруппаОтбора, ИмяПоля, Значение = Неопределено, ВидСравнения = Неопределено)
    НовыйЭлемент = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
    
    Если ВидСравнения = Неопределено Тогда
        НовыйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    Иначе
        НовыйЭлемент.ВидСравнения = ВидСравнения;
    КонецЕсли;
    
    Если Значение <> Неопределено Тогда
        НовыйЭлемент.ПравоеЗначение = Значение;
    КонецЕсли;
    
    НовыйЭлемент.Использование = Истина;
    НовыйЭлемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
    
    Возврат НовыйЭлемент;
КонецФункции
///////////////////////////////////////////////////////////////////////////////////////////


// ФИЛЬТР + СЧЕТЧИК // СОБЫТИЯ // Обработчики событий фильтров ревизиторв формы -  на клиенте
///////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура ОтборКонтрольНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// 1. Блокируем открытие стандартного окна выбора (лупу)
	СтандартнаяОбработка = Ложь;
	
	// 2. Вручную переключаем состояния: 0 -> 1 -> 2 -> 0
	ОтборКонтроль = (ОтборКонтроль + 1) % 3;
	
	// 3. Обновляем данные
	ОбновитьФильтрыНаСервере();
	Элементы.Список.Обновить();
		// Обновляем список сотрудников на сервере
    ЗаполнитьСписокСотрудников();
КонецПроцедуры
&НаКлиенте
Процедура ОтборННачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОтборН = (ОтборН + 1) % 3;
	
	ОбновитьФильтрыНаСервере();
	Элементы.Список.Обновить();
		// Обновляем список сотрудников на сервере
    ЗаполнитьСписокСотрудников();
КонецПроцедуры
&НаКлиенте
Процедура НПриИзменении(Элемент)
	ОбновитьФильтрыНаСервере();  
	
// Это принудительно заставляет таблицу пересчитать строки на экране
    Элементы.Список.Обновить();
		// Обновляем список сотрудников на сервере
    ЗаполнитьСписокСотрудников();
КонецПроцедуры
&НаКлиенте
Процедура КПриИзменении(Элемент)
	ОбновитьФильтрыНаСервере();  
	
// Это принудительно заставляет таблицу пересчитать строки на экране
    Элементы.Список.Обновить();
		// Обновляем список сотрудников на сервере
    ЗаполнитьСписокСотрудников();
КонецПроцедуры

&НаКлиенте
Процедура ОтборНомерДокументаПриИзменении(Элемент)
	ОбновитьФильтрыНаСервере();
	Элементы.Список.Обновить();
		// Обновляем список сотрудников на сервере
    ЗаполнитьСписокСотрудников();
КонецПроцедуры
&НаКлиенте
Процедура ОтборДатаДокументаПриИзменении(Элемент)
	ОбновитьФильтрыНаСервере();
	Элементы.Список.Обновить();
		// Обновляем список сотрудников на сервере
    ЗаполнитьСписокСотрудников();
КонецПроцедуры

&НаКлиенте
Процедура ОтборНеИсполненныеПриИзменении(Элемент)
    ОбновитьФильтрыНаСервере();         
	
//	Элементы.Список.Обновить() 
	// Обновляем список сотрудников на сервере
    ЗаполнитьСписокСотрудников();
КонецПроцедуры
 &НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ОбновитьФильтрыНаСервере();  
	
//	Элементы.Список.Обновить()
	// Обновляем список сотрудников на сервере
    ЗаполнитьСписокСотрудников();
КонецПроцедуры
&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ОбновитьФильтрыНаСервере();    
	
//	Элементы.Список.Обновить()
	// Обновляем список сотрудников на сервере
    ЗаполнитьСписокСотрудников();
КонецПроцедуры

// Одиночный выбор из списка // Поле скрыто
&НаКлиенте
Процедура ОтборИсполнительПриИзменении(Элемент)
    ОбновитьФильтрыНаСервере();     
	
//	Элементы.Список.Обновить()
КонецПроцедуры

&НаКлиенте
Процедура ОтборТекущийМножественныйПриИзменении(Элемент)
	
    // Обновляем фильтры:
    // - Не обновляем список сотрудников (чтобы список не закрывался)
    // - Обновляем счетчик
    ОбновитьФильтрыНаСервере(Ложь, Истина);
    Элементы.Список.Обновить();	
КонецПроцедуры
///////////////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////////////////
// КОМАНДА // КомандаЗнакДаты // КнопкаЗнакДаты // присвоение имени команды ( = ; < ; > )
///////////////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура КомандаЗнакДаты(Команда)
	
	// Считываем текущий заголовок кнопки
	ТекущийЗнак = Элементы.КнопкаЗнакДаты.Заголовок;
	
	// Циклическое переключение: = -> > -> < -> =
	Если ТекущийЗнак = "=" Тогда
		НовыйЗнак = ">";
	ИначеЕсли ТекущийЗнак = ">" Тогда
		НовыйЗнак = "<";
	Иначе
		НовыйЗнак = "=";
	КонецЕсли;
	
	// Устанавливаем новый текст на кнопку
	Элементы.КнопкаЗнакДаты.Заголовок = НовыйЗнак;
	
	// Обновляем фильтры и список
	ОбновитьФильтрыНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры
/////////////////////////////////////////////////////////////////////////////////////////// 
///////////////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////////////////
// КОМАНДА // переключение между фильтрами Исполнители / Ответственный
///////////////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура КомандаПереключитьФильтр(Команда)
	
    // Сохраняем текущие выбранные значения
    СохраненныеЗначения = Новый СписокЗначений;
    Для Каждого Элемент Из ОтборТекущийМножественный Цикл
        СохраненныеЗначения.Добавить(Элемент.Значение, Элемент.Представление);
    КонецЦикла;
    
    // Переключаем режим
    Если РежимФильтра = "Исполнители" Тогда
        РежимФильтра = "Ответственный";
        Элементы.КнопкаПереключатель.Картинка = БиблиотекаКартинок.картинка_6;
 //       Элементы.КнопкаПереключатель.Подсказка = "Текущий режим: Ответственный";
 //       Элементы.ОтборТекущийМножественный.Подсказка = "Выберите ответственных исполнителей";
    Иначе
        РежимФильтра = "Исполнители";
        Элементы.КнопкаПереключатель.Картинка = БиблиотекаКартинок.картинка_5;
//        Элементы.КнопкаПереключатель.Подсказка = "Текущий режим: Исполнители";
//        Элементы.ОтборТекущийМножественный.Подсказка = "Выберите исполнителей";
    КонецЕсли;
    
    // Восстанавливаем выбранные значения
    ОтборТекущийМножественный.Очистить();
    Для Каждого Элемент Из СохраненныеЗначения Цикл
        ОтборТекущийМножественный.Добавить(Элемент.Значение, Элемент.Представление);
    КонецЦикла;
    
    // Обновляем фильтры и список
    ОбновитьФильтрыНаСервере();
    Элементы.Список.Обновить(); 
		// Обновляем список сотрудников на сервере
    ЗаполнитьСписокСотрудников();
    
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////////////// 
///////////////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////////////////
//   «СброситьВсеФильтры» //  
/////////////////////////////////////////////////////////////////////////////////////////// 
///////////////////////////////////////////////////////////////////////////////////////////

//	&НаКлиенте
//	Процедура КомандаСброситьВсе(Команда)
		
//		// 1. Очистка сотрудников
//		ОтборТекущийМножественный.Очистить();
//		ОтборИсполнителиМножественный.Очистить();
//		ОтборОтветственныеМножественный.Очистить();
		
		// 2. Очистка дат и номера
//		ОтборВходящийНомер = "";
//		ОтборДатаПоступления = '00010101';
//		ОтборЗнакДаты = "="; // Возвращаем знак "Равно"
		
		// 3. Сброс периода на текущий месяц
//		ДатаНачала = НачалоМесяца(ТекущаяДата());
//		ДатаОкончания = КонецМесяца(ТекущаяДата());
//		
		// 4. Сброс галочек (Контроль, Н, Неисполненные)
//		ОтборКонтроль = 0; // Серый
//		ОтборН = 0;        // Серый
//		ОтборНеИсполненные = Истина; // По вашему ТЗ при открытии Истина
		
		// 5. Обновление иконок
//		Элементы.КнопкаПереключатель.Картинка = БиблиотекаКартинок.картинка_5;
		
		// Применяем пустые фильтры
//		ОбновитьФильтрыНаСервере();
//		Элементы.Список.Обновить();
		
//	КонецПроцедуры
  

/////////////////////////////////////////////////////////////////////////////////////////// 
///////////////////////////////////////////////////////////////////////////////////////////
